////////////////////////////////////////////////////////////////////////////////
//
/// Camera/Camera.h содержит класс камеры, описывающий положение модели на экране
//
////////////////////////////////////////////////////////////////////////////////
#pragma once

#include <Math/Vector3f.h>
#include <Math/Matrix.h>

////////////////////////////////////////////////////////////////////////////////
//
/// Объект камеры
/**
  Отвечает за подготовку матрицы трансформации вида (хранит текущее положение наблюдателя, 
  углы поворота.
*/
////////////////////////////////////////////////////////////////////////////////
class Camera
{
  Vector3f m_position;
  float m_rotationX = 0.0f;
  float m_rotationY = 0.0f;
  float m_rotationZ = 0.0f;

public:
  Camera();

   /// Задать перемещение
  void Move(float dx, float dy, float dz);
  /// Задать вращение
  void Rotate(float angleX, float angleY, float angleZ);
  /// Выдать матрицу трансформации вида
  Matrix4f GetViewMatrix() const;

private:
  /// Рассчитать матрицу вращения
  Matrix4f GetRotationMatrix() const;
};