////////////////////////////////////////////////////////////////////////////////
//
/// UI/RenderView/ShaderProgram.h содержит класс ShaderProgram - RAII обертка над шейдерной программой
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

#include <GL/glew.h>
#include <GL/GL.h>

////////////////////////////////////////////////////////////////////////////////
//
///
/** 
    ShaderProgram - RAII обертка над шейдерной программой
*/
////////////////////////////////////////////////////////////////////////////////
class ShaderProgram
{
private:
  GLuint m_program = 0;

public:
  ShaderProgram() = default;
  ~ShaderProgram();

  // Создать программу
  void Create();
  // Освободить занятые ресурсы
  void Destroy();
  // Выдать идентификатор программы
  GLuint Id() const { return m_program; }

};