////////////////////////////////////////////////////////////////////////////////
//
/// IView.h содержит интерфейс для взаимодействия контроллера с представлением
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

struct IModelProvider;
struct IViewObserver;


////////////////////////////////////////////////////////////////////////
//
/// Интерфейс взаимодействия контроллера с представлением
/**
*/
////////////////////////////////////////////////////////////////////////
struct IView
{
  virtual ~IView() = default;

  /// Установить подписчика на события представления
  virtual void SetViewObserver(IViewObserver * observer) = 0;
  /// Установить проводника модели
  virtual void SetModelProvider(IModelProvider * modelProvider) = 0;
  /// Отрисовать сцену
  virtual void RenderScene() = 0;
};
