#include "Scene.h"

#include <Math/Matrix.h>


//------------------------------------------------------------------------------
/**
   Изменить положение модели на сцене
*/
//---
void Scene::SetTranslation(float dx, float dy, float dz)
{

}


//------------------------------------------------------------------------------
/**
   Изменить углы вращения модели на сцене
*/
//---
void Scene::SetRotation(float rx, float ry, float rz)
{

}


//------------------------------------------------------------------------------
/**
   Изменить масштаб
*/
//---
void Scene::SetScale(float scale)
{

}


//------------------------------------------------------------------------------
/**
   Выдать матрицу трансформации вида
*/
//---
const Matrix4f & Scene::GetViewMatrix() const
{
  return Matrix4f::Identity();
}


//------------------------------------------------------------------------------
/**
   Выдать матрицу проекции
*/
//---
const Matrix4f & Scene::GetProjectionMatrix() const
{
  return Matrix4f::Identity();
}


 
//------------------------------------------------------------------------------
/**
   Функция создания
*/
//---
std::unique_ptr<IScene> CreateScene()
{
  return std::unique_ptr<IScene>(new Scene());
}
