////////////////////////////////////////////////////////////////////////////////
//
/// Controller/IModelService.h содержит интерфейс объекта, отвечающего за чтение/запись модели
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

#include <string>

////////////////////////////////////////////////////////////////////////
//
/// Интерфейс объекта, отвечающего за чтение/запись модели.
/**
*/
////////////////////////////////////////////////////////////////////////
struct IModelService
{
  virtual ~IModelService() = default;

  /// Загрузить модель с диска
  virtual bool Load(const std::string & path) = 0;
  /// Записать модель на диск
  virtual void Save() = 0;
  /// Записать модель как
  virtual void SaveAs(const std::string & path) = 0;
};