////////////////////////////////////////////////////////////////////////////////
//
/// IModelProvider.h содержит интерфейс, предоставляющий доступ к данным модели
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

#include <vector>

#include "Math/Matrix.h"


////////////////////////////////////////////////////////////////////////
//
/// Интерфейс контроллера для предоставления доступа к данным модели.
/**
  Определяет методы получения рендером данных для отрисовки
*/
////////////////////////////////////////////////////////////////////////
struct IModelProvider
{
  virtual ~IModelProvider() = default;

  /// Получить вершины для отрисовки
  virtual std::vector<Vertex> GetVertexes() const = 0;
  /// Получить индексы порядка отрисовки вершин
  virtual std::vector<unsigned int> GetIndices() const = 0;
  /// Получить матрицу MVP 
  virtual Matrix4f GetMVPMatrix() const = 0;
};
