////////////////////////////////////////////////////////////////////////////////
//
/// IViewObserver.h содержит интерфейс подписчика на события от View
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

/// Направление движения модели на сцене
enum class Direction
{
  Left,
  Right,
  Up,
  Down
};


/// Ось вращения модели на сцене
enum class Axis
{
  X,
  Y,
  Z
};


////////////////////////////////////////////////////////////////////////
//
/// Интерфейс контроллера стандартной части UI.
/**
  Определяет методы для обработки событий UI, связанных с нажатием кнопок,
  связанных с трансформацией модели.
*/
////////////////////////////////////////////////////////////////////////
struct IViewObserver
{
  virtual ~IViewObserver() {};

  // Обработка нажатия на кнопки трансляции
  virtual void MoveModel(Direction dir, float delta) = 0;
  // Обработка нажатия на кнопки вращения модели
  virtual void RotateModel(Axis axis, float angle) = 0;
  // Обработка нажатия на кнопки масштаба
  virtual void ScaleModel(float scale) = 0;
};
