////////////////////////////////////////////////////////////////////////////////
//
/// IViewObserver.h содержит интерфейс подписчика на события от View
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

/// Направление движения модели на сцене
enum class Direction
{
  Left,
  Right,
  Up,
  Down,
  Front,
  Back
};


/// Ось вращения модели на сцене
enum class Axis
{
  X,
  Y,
  Z
};


/// Направление вращения
enum class RotationDirection
{
	CW, // по часовой стрелке
	CCW // против часово стрелки
};


/// Масштабирование
enum class Scaling
{
	INC, // увеличить
	DESC // уменьшить
};


////////////////////////////////////////////////////////////////////////
//
/// Интерфейс контроллера стандартной части UI.
/**
  Определяет методы для обработки событий UI, связанных с нажатием кнопок,
  связанных с трансформацией модели.
*/
////////////////////////////////////////////////////////////////////////
struct IViewObserver
{
  virtual ~IViewObserver() {};

  // Обработка нажатия на кнопки трансляции
  virtual void MoveModel(Direction dir) = 0;
  // Обработка нажатия на кнопки вращения модели
  virtual void RotateModel(Axis axis,RotationDirection rDir) = 0;
  // Обработка нажатия на кнопки масштаба
  virtual void ScaleModel(Scaling scale) = 0;
};
