#include "Model.h"


//------------------------------------------------------------------------------
/**
   Переместить модель
*/
//---
void Model::Translate(float dx, float dy, float dz)
{

}


//------------------------------------------------------------------------------
/**
   Повернуть модель
*/
//---
void Model::Rotate(float angleX, float angleY, float angleZ)
{

}


//------------------------------------------------------------------------------
/**
   Масштабировать
*/
//---
void Model::Scale(float sx, float sy, float sz)
{

}


//------------------------------------------------------------------------------
/**
   Получить вершины для отрисовки
*/
//---
std::vector<Vertex> Model::GetVertexes() const
{
  return m_vertices;
}


//------------------------------------------------------------------------------
/**
    Получить индексы порядка отрисовки вершин
*/
//---
std::vector<unsigned int> Model::GetIndices() const
{
  return m_indices;
}


//------------------------------------------------------------------------------
/**
    Получить индексы порядка отрисовки вершин
*/
//---
Matrix4f Model::GetMVPMatrix() const
{
  return {};
}
