#include "Model.h"

#include <Math/AxisAlignedBoundedBox.h>
#include <Math/MathUtils.h>


//------------------------------------------------------------------------------
/**
   
*/
//---
Model::Model()
  : m_vertices{{{-0.5f, -0.5f, 0.5f}, {0.0f, 0.0f}}, 
      {{-0.5f, 0.5f, 0.5f}, {0.0f, 1.0f}}, 
      {{0.5f, 0.5f, 0.5f}, {1.0f, 1.0f}},
      {{0.5f, -0.5f, 0.5f}, {1.0f, 0.0f}},  
      {{-0.5f, -0.5f, -0.5f}, {0.0f, 0.0f}}, 
      {{-0.5f, 0.5f, -0.5f}, {0.0f, 1.0f}},
      {{0.5f, 0.5f, -0.5f}, {1.0f, 1.0f}},   
      {{0.5f, -0.5f, -0.5f}, {1.0f, 0.0f}}, {{-0.5f, -0.5f, 0.5f}, {1.0f, 0.0f}},
               {{-0.5f, 0.5f, -0.5f}, {0.0f, 1.0f}}, {{-0.5f, 0.5f, 0.5f}, {1.0f, 1.0f}},   {{-0.5f, -0.5f, -0.5f}, {0.0f, 0.0f}},
               {{0.5f, -0.5f, 0.5f}, {0.0f, 0.0f}},  {{0.5f, 0.5f, 0.5f}, {0.0f, 1.0f}},    {{0.5f, 0.5f, -0.5f}, {1.0f, 1.0f}},
               {{0.5f, -0.5f, -0.5f}, {1.0f, 0.0f}}}
  , m_indices{0, 1, 2, 0, 2, 3, 4, 6, 5, 4, 7, 6, 8, 9, 10, 8,11, 9, 12, 13, 14, 12, 14, 15, 1, 6, 2, 1, 5, 6, 0, 3, 7, 0, 7, 4}
  , m_boundedBox(CalculateBoundedBox(m_vertices))
  , m_transform(Matrix4f::Identity())
{
}


//------------------------------------------------------------------------------
/**
   Переместить модель
*/
//---
void Model::Translate(float dx, float dy, float dz)
{
}


//------------------------------------------------------------------------------
/**
   Повернуть модель
*/
//---
void Model::Rotate(float angleX, float angleY, float angleZ)
{
}


//------------------------------------------------------------------------------
/**
   Масштабировать
*/
//---
void Model::Scale(float scale)
{
  m_transform[0][0] += scale;
  m_transform[1][1] += scale;
  m_transform[2][2] += scale;
}


//------------------------------------------------------------------------------
/**
   Получить вершины для отрисовки
*/
//---
const std::vector<Vertex> & Model::GetVertices() const
{
  return m_vertices;
}


//------------------------------------------------------------------------------
/**
    Получить индексы порядка отрисовки вершин
*/
//---
const std::vector<unsigned int> & Model::GetIndices() const
{
  return m_indices;
}


//------------------------------------------------------------------------------
/**
    Получить матрицу трансформации
*/
//---
Matrix4f Model::GetTransformMatrix() const
{
  return m_transform;
}


//------------------------------------------------------------------------------
/**
    Получить ограничивающий объем модели
*/
//---
const AxisAlignedBoundedBox & Model::GetBoundedBox() const
{
  return m_boundedBox;
}
