////////////////////////////////////////////////////////////////////////////////
//
/// IScene.h содержит интерфейс, предоставляющий доступ объекту состояния сцены
/**
*/
////////////////////////////////////////////////////////////////////////////////
#pragma once

class Matrix4f;

////////////////////////////////////////////////////////////////////////
//
/// Интерфейс для взаимодействия со сценой
/**
*/
////////////////////////////////////////////////////////////////////////
struct IScene
{
  virtual ~IScene() = default;

  /// Изменить положение модели на сцене
  virtual void SetTranslation(float dx, float dy, float dz) = 0;
  /// Изменить углы вращения модели на сцене
  virtual void SetRotation(float rx, float ry, float rz) = 0;
  /// Изменить масштаб
  virtual void SetScale(float scale) = 0;
  /// Выдать матрицу трансформации вида
  virtual const Matrix4f & GetViewMatrix() const = 0;
  /// Выдать матрицу проекции
  virtual const Matrix4f & GetProjectionMatrix() const = 0;
};